# Taps
tap "bradyjoslin/rsieve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Copies all or portions of a remote GitHub repo
brew "rsieve"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Monitors common persistence locations
cask "blockblock"
# Managed desktop virtualization solution
cask "citrix-workspace"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Digital design and prototyping platform
cask "sketch"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
